---
kind: method
id: M:Autodesk.Revit.DB.FamilySizeTableManager.GetAllSizeTableNames
source: html/e043b624-d464-d0f3-e1c6-3a5bdaaa3238.htm
---
# Autodesk.Revit.DB.FamilySizeTableManager.GetAllSizeTableNames Method

Get the FamilySizeTable names in a family.

## Syntax (C#)
```csharp
public IList<string> GetAllSizeTableNames()
```

## Returns
Array of size table names.